[
    {
        "poem_id": "1",
        "poem_heading": "The Man In The Wheel Chair",
        "poem_info": "Get out of your wheel chair (Mind).",
        "poem_content": "<p>He sat there under that old tree,The man in the wheel chair.<br>No one came his way.<br>He sat there from dawn to dusk,<br>Looking out for help.<br>His mind said, get up and walk.<br>But his brain said, you can&apos;t walk.<br>He sat there in the middle of the field,<br>Thinking of what he was.<br>He wanted to walk again,<br>He wanted to free himself,<br>Coz he wanna be himself.<br>The mind said, get up and walk man!<br>But the brain said, you can&apos;t walk….<br>He rolled across the field daily,<br>Coz he was in the wheel chair mainly.<br>He sat there under the dark sky,<br>Thinking if he could walk again.<br>The mind said, get up and walk, you can do it…<br>But the brain said, you can&apos;t walk.<br>The man tried to get up but he couldn&apos;t.<br>The mind said, you can do it.<br>He tried again and he stood up,<br>But he fell down…….<br>The mind said, get up and try again.<br>He stood up and he walked.<br>He fell and he got up and walked,<br>He struggled and walked back home,<br>Across the field, and he was covered in mud<br>And in filth but, he was a free man.<br>He was no more,<br>The man in the wheel chair.<br></p>"
    },
    {
        "poem_id": "2",
        "poem_heading": "The Night When It Rained",
        "poem_info": "The Rain always inspires me.",
        "poem_content": "<p>In the night of silence,<br>I heard the sounds of violence<br>Of the tiny soldiers of God&apos;s army.<br>The greatest power of nature,<br>It saves and kills,<br>Like we exchange bills.<br>That night was like none other<br>Cause I heard the inner<br>Commotions of my heart in the outer<br>World of mystical nature,<br>It was like nature relieved<br>Me of my tension in a beautiful yield<br>Of the greatest gift that everyone wishes for,<br>Cause that&apos;s when you feel to be fearless,<br>Happy of what has happened and what will.<br>That&apos;s when you feel the love of nature.<br>That&apos;s when you feel happy.<br>That&apos;s when you feel free.<br>That&apos;s when you feel to<br>Write a poem !<br>The words flow into you, like<br>The rain that pours down hard<br>On the ground outside.<br>Then you realise that there&apos;s<br>No other feeling greater than that<br>Of rain, which showers on<br>You, like a million blessings of<br>Love and care from the Gods<br>And from the old and lost from<br>Your life. That&apos;s when<br>You realise life is too<br>Short to complain !!<br></p>"
    },
    {
        "poem_id": "3",
        "poem_heading": "The Day When The World Stood Still",
        "poem_info": "A verse that will keep A P J Abdul Kalam alive! ",
        "poem_content": "<p>That day when the people stood still<br>On their way back home<br>That day the dogs and cats stood still<br>On the streets of the world<br>That day the leaves of the trees<br>Stood still all over the world<br>The day when the world stood still<br>Was the day when the Great<br>Man who taught us to dream<br>With our eyes open, had become still...<br>He had no money, he had no greed<br>He had love, he had passion<br>For science and for others&apos; beautiful life<br>He may be still but he is still<br>Running around in my<br>Heart and Soul<br>I ain&apos;t building monuments<br>In his name coz<br>As Shakspeare said....<br>“You shall live forever<br>In my verse”...<br></p>"
    },
    {
        "poem_id": "4",
        "poem_heading": "A Lonely Walk",
        "poem_info": "When I went on a walk.",
        "poem_content": "<p>I walked on and on<br>Through the winding path.<br>Sometimes I was happy and alone,<br>At times I was overcome by grief<br>But none could help me.<br>There were obstacles in front of me <br>In the form of plants, animals and<br>Some others in the form of what I don&apos;t know<br>But I did not give up, I walked along<br>Fighting through the obstacles.<br>I heaved the tree out of my way<br>All by myself<br>I fought the lion out<br>All by myself<br>There were theieves that I had to endure<br>All by myself<br>And I walked on and on<br>Down the path of life<br>To the hands of Death.<br>I suffered to walk<br>Along this path because<br>I knew it led to death eventually.<br>I overcame my problems<br>Because if I didn&apos;t the end of<br>The path will come early.<br>I still have to walk on and on<br>I have to overcome obstacles<br>I have to endure injuries<br>That are yet to come on this<br>Path of Life..........<br>I can&apos;t be helped by those<br>Who walk on similar paths<br>Cause this path is only for me.<br>I can build junctions<br>On this path by doing<br>Noble deeds and being noted<br>I have two junctions to make<br>Hence I gotta walk on<br>Walk on and on<br>Down the Path of Life<br>Happily to Death!</p>"
    },
    {
        "poem_id": "5",
        "poem_heading": "My Dreams",
        "poem_info": "The title says it all!",
        "poem_content": "<p>Its dream that may stay a dream<br>But I don&apos;t care cause I&apos;ll make it true<br>I don&apos;t care if it&apos;s a dream<br>I care it&apos;s my life<br>It&apos;s the fantasy of an old woman<br>That I&apos;ll make the ambition of many<br>It&apos;s the dream of a soldier to defend the country<br>That I&apos;ll make easier to make true<br>It&apos;s the love for nature that<br>I&apos;ll show with my dream<br>It&apos;s not a dream,<br>It&apos;s my dreams that I&apos;ll make reality<br>Cause I know my quality,<br>I don&apos;t wait for the water to reach the brim<br>I jump in and make it reach the brim<br>Cause I know I have the core,<br>I have the inner strength to care,<br>Care for the nature, care<br>For the life of others<br>I don&apos;t know why I have<br>Such dreams, like mine<br>May be because I whine<br>For the nature or because<br>I love fantasy or is it because<br>I love my country<br>I think it&apos;s the love for all,<br>All in the world, no<br>All whom I love and those<br>Who love me,<br>I&apos;ll make it true,<br>once when I can<br>But I will before I can&apos;t<br>I&apos;ll do it before I die.</p>"
    },
    {
        "poem_id": "6",
        "poem_heading": "Journey",
        "poem_info": "About the journey of life.",
        "poem_content": "<p>The life it&apos;s a journey that,<br>Starts once and ends once,<br>You can&apos;t get down until,<br>The stop decided for you reaches.<br>But you can change the<br>Compartments, one to another,<br>In each one there are similar<br>And different people.<br>You stay in each compartment<br>For different times<br>Some touch you in the heart,<br>Some don&apos;t bother you.<br>Some stay close, some<br>Stay away, when<br>We enter we feel<br>Delighted but when we<br>Leave it breaks our heart<br>And soul into pieces<br>We discover a lot in<br>This journey and<br>Yet another leaving<br>Has occurred again<br>Hope we can sustain it<br>Oh! Lord help us!!<br>To survive this<br>Big journey!</p>"
    },
    {
        "poem_id": "7",
        "poem_heading": "Sunshine",
        "poem_info": "When you long for the eternal.",
        "poem_content": "<p>Let us stay up all night and<br>Watch the moon fade away in to the horizon.<br>While the first rays of the sun grace our faces,<br>Let us run into golden beauty of the day.<br>And we can stay in the Eternal Sunshine,<br>Always Happy,<br>Always Smiling,<br>In true bliss.</p>"
    },
    {
        "poem_id": "8",
        "poem_heading": "Quarantiverse",
        "poem_info": "Verse written in Quarentine.",
        "poem_content": "<p>As I look out the window<br>I see nothing but sorrow<br>The roads had people going about<br>But now I see none about<br>We are all stuck like the animals in the zoo<br>And all I can do is boo<br>At humans for not being an Ace<br>In this difficult phase<br>Alas everything should end for better or worse<br>Just like my verse.</p>"
    },
    {
        "poem_id": "9",
        "poem_heading": "Light of Life",
        "poem_info": "Where do you look for the Light of Life?",
        "poem_content": "<p>Look for a million years for the Light of Life<br>In others and you shall never find it,<br>Look within yourself and you shall find it,<br>Waiting to be discovered,<br>Preserved from the Darkness of Life,<br>Unscathed from the hardships you have gone through.<br>Waiting for you,<br>For the owner is one.<br>Look within and you shall find the Light of Life.</p>"
    },
    {
        "poem_id": "10",
        "poem_heading": "Last Weep",
        "poem_info": "For there is no more fight left.",
        "poem_content": "<p>He couldn&apos;t speak,<br>Cause he was weak.<br>The salty water creeped in,<br>He let the sea win<br>For, all he thought he had,<br>Was nothing but a fad.<br>The great white circled him,<br>He slipped into a wicked trance;<br>The water that was killing him<br>Felt like a warm blanket,<br>Cozy, relaxing and heavy,<br>It made him feel light,<br>Drifting into eternal sleep<br>He had just one last weep.<br></p>"
    },
    {
        "poem_id": "11",
        "poem_heading": "Starfish",
        "poem_info": "Stuck like a starfish on the deck.",
        "poem_content": "<p>All he wanted was to jump in,<br>But the strings on the boat differed.<br>He knew he'd love to be in<br>But oh the comfort of just watching.<br>The blue tides kept beckoning,<br>He could only keep it waiting.<br>Would the beauty of the tides be his killer?<br>He knew not, yet willing to take the wager.<br>All he wanted was to jump in,<br>Yet he stood on the starboard unable to move.<br>Neither in nor back.<br>Like the starfish on the deck.</p>"
    },
    {
        "poem_id": "12",
        "poem_heading": "Kiss of Pain",
        "poem_info": "The losses of war.",
        "poem_content": "<p>He held her in his arms,<br>She looked into his eyes,<br>All she wanted was for him to stay<br>But destiny pulled him away.<br>He kissed her in pain,<br>He knew not if they&apos;d meet again.<br> She held him tight and whispered,<br>&quot;Don&apos;t leave me, I am scared&quot;.<br>He held her tighter, &quot;I&apos;ll be back, I promise&quot;.<br>The siren cried in despair of demise.<br>She waited for the love of her life,<br>But all she got was the letter for the wife.<br>She wept hugging the casket,<br>Looking at the baby in basket.</p>"
    },
    {
        "poem_id": "13",
        "poem_heading": "The woman with a paper heart",
        "poem_info": "I met a woman with a paper heart.",
        "poem_content": "<p>I met a woman with a paper heart,<br/>It was crumpled for it was hurt.<br/>It was torn but stuck together with tape,<br/>My eyes transfixed on the beauty as I gape.<br/>I asked her if I could write poems,<br/>With the ink from my blood.<br/>Pour into the creases my poems,<br/>That had secrets between the lines. <br/>Before she could answer,<br/>She was whisked away by the wind,<br/>That blew her into the beautiful sunset. </p>"
    },
    {
        "poem_id": "14",
        "poem_heading": "The Red Moon",
        "poem_info": "It was like her face when she swoon.",
        "poem_content": "<p>He looked up at the moon,<br/>It was red like her face when she swoon.<br/>A smile as tender as her touch spread<br/>Across his face as he read,<br/>The light from his candle<br/>Glistened over her beautiful calligraphy.<br/>He kept it away for he could not handle<br/>The thoughts that came to him like in an autobiography.<br/>He knew not if she&apos;d ever understand,<br/>But he knew he&apos;d never reprimand.<br/>He looked up at the moon,<br/>It was red like her face when she swoon.</p>"
    },
    {
        "poem_id": "15",
        "poem_heading": "Forbidden Love",
        "poem_info": "When love slips out of your hands.",
        "poem_content": "<p>&quot;Oh girl, I wanted to tell you first,<br/>About my journey for the crest. <br/>I know not when I shall return,<br/>But when I do, to meet you I yearn. <br/>Oh girl, when my letters find you,<br/>I hope it brings my love for you. <br/>Oh girl, I long for this forbidden love,<br/>For all I have is the crest and you my love.&quot;<br/>Cried the sailor,<br/>As he sailed for valour. </p>"
    },
    {
        "poem_id": "16",
        "poem_heading": "A few moments",
        "poem_info": "All he wanted was a few moments with her.",
        "poem_content": "<p>All he wanted was a few moments with her,<br/>A few moments where only they existed in the whole world. <br/>A few moments where the moon shine so bright that the street lights shied away. <br/>A few moments where the wind blew so light that it tickled her neck. <br/>A few moments where nothing else mattered. <br/>A few moments in pure love. <br/>A few moments of bliss. <br/>A few moments together.</p>"
    },
    {
        "poem_id": "17",
        "poem_heading": "रेगिस्थान पर बनी निशान",
        "poem_info": "सिर्फ निशानियाँ बाकी हैं ।",
        "poem_content": "<p>रेगिस्थान पर बन रही थी उसके निशान<br/>और मै यहाँ बर्फ पर।<br/>थी नहीं वो मेरी कभी<br/>शायद नही होगी कभी<br/>पर मै हूंगा उसका<br/>हमेशा।</p>"
    },
    {
        "poem_id": "18",
        "poem_heading": "The sunflower that loved the moon.",
        "poem_info": "All she wanted was to be with the moon.",
        "poem_content": "<p>A sunflower that loved the moon,<br/>All she wanted was to be with the moon,<br/>But she would know different soon. <br/>She stayed up all night talking to him,<br/>But she was mere beauty to him.<br/>When her friends danced in the sun,<br/>She was dying as she got none.<br/>She was singing to the moon<br/>But he preferred the song of the stars.<br/>Days passed, weeks passed,<br/>And one day he too passed.<br/>She cried, she screamed, she wailed,<br/>Nobody heard her, nobody cared.<br/>She noticed a tiny firefly flying around her,<br/>She asked him, why such a fate bedevilled her.<br/>He replied, for in search of the shiniest,<br/>You forgot to see the trustable lanterns.<br/>Next day when the moon was back,<br/>She was singing again, <br/>But for the little firefly that actually loved her,<br/>Little did the firefly know, that he was the moon she loved and she <br/>The sunflower that loved the moon. </p>"
    },
    {
        "poem_id": "19",
        "poem_heading": "And there I stood.",
        "poem_info": "When love slips out of your hands",
        "poem_content": "<p>And there I stood as you called for him,<br/>With a mountain weighing down on my heart. <br/>I wanted to scream out loud,<br/>Look and smile is all I could. <br/>You embraced him with all the love in the world,<br/>And there I stood parched, unable to move. <br/>The bread felt like a boulder stuck in my throat,<br/>The water like a raindrop in a desert. <br/>And there I stood, looking on unable to cry again.</p>"
    }
]
