[
    {
        "review_id": "1",
        "movie_name": "Trance",
        "rating": "4.5",
        "review_content": "<p>In one word I&apos;d say no less than EPIC.<br/>Anwar Rasheed & Amal Neerad Combo working the magic again leaving us all spellbound. Fahad Fasil has yet again proved that he&apos;s the best in what he does and has delivered with an unthinkable level of perfection the character of Viju Prasad. Sound design by the legend Resul Pookutty himself and I have to say no more because the nuances he has brought out in the bigger picture just makes you wanna just listen to the movie again and again. The cinematography by Amal and sounds just take you into the movie. Not one moment did it feel like I&apos;m watching a movie. I felt I was taking the journey with Viju Prasad myself. The movie shows the travel of Viju Prasad which is mostly happening on the inside and how that affects his outer surroundings. The story is well planned and written making sure we keep waiting and wanting to know what happens next. Lot of prominent guest roles all at the crucial points used perfectly. I had seen many reviews stating that the second half lagged or that there wasn&apos;t proper end, but I didn&apos;t even feel a second of lag in the whole movie except maybe the starting credits and the end I can&apos;t think of another ending that would convey the story and the message so well. TRANCE gives one message and that is &quot;RELIGION IS THE MOST DANGEROUS DRUG&quot;</p>"
    },
    {
        "review_id": "2",
        "movie_name": "Forensic",
        "rating": "3",
        "review_content": "<p>Good movie. One time watchable. Psycho thriller genre is growing and this is proof of it coz even though it&apos;s the same genre as Anjaam Pathira it felt very different. Not to compare but this one is not as much on the edge as Anjaam Pathira. That said the music and BGM does really put you in the mood. The forensic side is really interestingly captured. Liked the direction and story. One time watchable.</p>"
    },
    {
        "review_id": "3",
        "movie_name": "Soorarai Pottru",
        "rating": "4.5",
        "review_content": "<p><i>This review may contain spoilers.</i><br/>It is the dream project of the director Sudha Kongara, and it is very well seen in each frame of the movie.<br/>My eyes were completely glued to the screen for the whole of 2 hours and 33 minutes. Throughout the movie we feel the pain and pressures of failure, the motivations, the anger and the happiness that Surya&apos;s Nedumaaran Rajangam is going through. Each time he faces a setback it hits you since it is conveyed well through the movie with great visuals and apt background scores. Director Sudha has used the ability of Surya to be tough and vulnerable at the same time very well.<br/>Another great thing I noticed was that the female characters in the movie unlike other movies have been given important roles and have been given equally important screen time and dialogues as well. Aparna Balamurali&apos;s Bommi and Urvashi&apos;s Pechi both are instrumental in Nedumaaran&apos;s life journey and the eventual achieving of his goal In traditional movies you get to see the hero and his struggles and success is given importance and the female characters that support him are most often overshadowed, but here we can see a clear distinction from this and instead the female characters who actually play a major role in the hero&apos;s life have been appreciated and shown to be equal to the hero and in-fact one of the main reasons for the success of the hero.<br/>The movie overall has a motivational feel and when you finish watching the movie you are filled with happiness and a feeling of success or fulfilment and at the same time you feel motivated to do something, to bring about a change in the world.<br/>The movie revolves around the struggles of Nedumaaran, a man from a remote village with barely any railway connectivity who wants to fly and to make his fellow people from the financially weaker sections also fly.<br/>The movie puts light on the various layers of corruption and how the government and the common people have been fooled by the rich for their benefits. While this is the main topic of the movie, it also effectively packages a few other important life lessons like the importance of having equality in relationships, that no dream is bigger than another and that time is the most valuable thing in life very well. Aparna&apos;s Bommi is a character that breaks boundaries when it comes to tamil cinema, as she might be the first to visit the hero&apos;s house for a wedding proposal. She later delivers a powerful line that both she and Nedumaaran clearly have fallen in love with their dreams and that they should try and succeed in their 1st marriage (the dream) and then think about the proposal. This is very powerful as it shows that she has recognised that he is as focused and interested in his dream as shels in hers and, tha both of them should focus on their dreamsias it is very important for the both of them. Bommi succeeds fairly well compared to Nedumaaran in achieving her dream, yet when she is approached again by Nedumaaran she keeps forth 3 conditions, which are that both their dreams should be considered equal, he should always care about the family and that both their earnings are for both of them.<br/>This is again a powerful line from Bommi, which shows how she makes sure that the both of them are equal and are there for each other at all times, just like how a marriage should be.<br/>Another such important scene is when Nedumaaran is egoistic and is shy to ask her for money and keeps telling that he&apos;d return it as soon as possible and that she can keep tabs. Bommi asks why he has so much ego to ask his wife for help and reminds him that it was one of their conditions that her earnings are for him and his for her. Similarly another scene where she shows that she is independent and also cares for his dreams is when she tells him to deal with the press after an unsuccessful first flight when she was in labour pain.<br/>The scene where Bommi goes to Nedumaaran&apos;s office as the owner of Bommi Bakery to talk about the business deal of catering in the flight, he first reacts as he would to his wife but when she says that she is here for business he too becomes serious and goes ahead to talk about the deal. They also agree to deal with each other just like they would treat any other client with respect to the business. This clearly gives a message to the viewers that each of their businesses are very much important to them and they respect each other&apos;s business and their position in the aE business. Overall the movie shows us how important the people around you are to your dream as the work you put in. Even with a thousand people trying to stop you, there will be a few that will trust you, your hard work and perseverance to give you the strength to achieve that which most would deem impossible. The movie is inspired by the events from the life of<br/>G. R. Gopinath and it adds to the motivational feel of the movie.</p>"
    },
    {
        "review_id": "4",
        "movie_name": "Drishyam 2",
        "rating": "4",
        "review_content": "<p>The first thing that came in to my mind after watching this movie is that it is one of the best sequels ever made in Malayalam Cinema. The story is starts out calm and a few insanely brilliant twists later the movie changed from a calm movie showing the life of a family involved in such a crime to a brilliant crime thriller. The level of detailing in the story is the highlight as it is what makes us feel like this is the sequel that should&apos;ve come way earlier and the most apt one at that. Jeethu Joseph is the real star of this movie. The camera work is also commendable as it keeps you hooked to the movie. Acting wise all the actors have delivered the same level of performance we saw from Drishyam. The sound track is placed right and adds efficiently to the screenplay. Just one thing to end with, this was a movie that would have seen immensely huge success in the theatres just like it&apos;s predecessor.</p>"
    },
    {
        "review_id": "5",
        "movie_name": "Operation Java",
        "rating": "3",
        "review_content": "<p>The movie is one that revolves around two BTech graduates trying to make ends meet and how they assist the cyber cell in solving cases. Overall it is good movie. As a directorial debut Tharun Moorthy has done a great job as it doesn&apos;t feel like a debut movie. Faiz Siddik has done a good job with the cinematography as it takes us along with Antony (Balu Varghese)  and Das (Lukman). The BGM by Jake&apos;s Bejoy is on point and exciting. There are 2-3 scenes where the frame and the BGM make you go &quot;woah that&apos;s dope&quot;. All actors have given a good performance but one commendable role is that of Vinayakan who has a short screen time but makes you feel. The cinematography gave me Action Hero Biju vibes. Mathew Thomas has a very small role and I think it could&apos;ve been much better. The movie provides a look into the workings of the cyber cell and the plight of temporary staff in all government offices as well. The movie is one time watchable.</p>"
    },
    {
        "review_id": "6",
        "movie_name": "Irul",
        "rating": "2.5",
        "review_content": "<p>Movie as a whole is average, nothing exceptional. Fahad again does a great job in his role, Darshana was great too, Soubin could&apos;ve been better. Cinematography was done well, it kept us hooked with each scene, so was the BGM and Sound Design. The color grading added to the mood very well, though I felt like it was made a bit too dark in the first few minutes which caused loss of details in the visuals. The story was kind of predictable at some points, but the director tries to divert us and maintain the suspense upto an extent. Direction played the major role is keeping it thrilling. Overall it is a average one time watchable movie.</p>"
    },
    {
        "review_id": "7",
        "movie_name": "Joji",
        "rating": "4",
        "review_content": "<p>A well made movie that looks at greed and it&apos;s aftermath inspired by Macbeth, JOJI has been made in a smooth yet thrilling way. The whole movie never shocks you it goes in a flow. As it&apos;s genre says, it is a crime drama. Dileesh Pothan has done a great job as usual in telling the story in the best way possible, it being a plot that has been tried before in Malayalam yet he was able to bring a new spirit to it. Fahadh, Baburaj and Unnimaya have shown great performance and the visuals by Shyju Khalid as usual is amazing. Overall it is a must watch modern retelling of Macbeth. If you haven&apos;t watched it yet, do check it out on Prime.</p>"
    },
    {
        "review_id": "8",
        "movie_name": "Chathur Mukham",
        "rating": "4",
        "review_content": "<p>This is one movie that stands out from all others in the Malayalam industry because of it&apos;s treatment of the horror genre. Usually I am not a fan of horror movies, because it is more or less the same plot in most movies, but this being given the title of Techno-Horror really intrigued me, as I love tech. I feared the movie would be a cliché technology is gonna kill you, AI gone rouge, that kind of story, but as soon as the movie started I was proved wrong. The movie takes you through the story very well, the cinematography helps with inducing the feeling of excitement and the urgency to know what will happen next, which keeps you engaged to the movie. Unlike usual horror movies this one has very minimal jump scares. It puts you in another kind of horror feeling. Manju Warrier&apos;s acting as usual is exceptional, but I felt like most other actors were struggling a lot to match her level of acting and yet didn&apos;t reach it. The music is a very mind numbing one that really keeps you trapped in the mood, there is a high chance you will end up whistling the tune as you walk out of the theater . It is to be noted that, it being a theater release, it has been removed from the theater  temporarily due to increasing cases of covid. I hope the movie gets a rerelease or comes on OTT soon so that more people can enjoy and appreciate this new take on horror. </p>"
    },
    {
        "review_id": "9",
        "movie_name": "Biriyaani",
        "rating": "4.5",
        "review_content": "<p>This is a movie that you rarely get to see, it is one that shouts out the many wrongs happening in our society fearlessly. The director Sajin Baabu has made sure that even though it is only a 1 hour 30 minute movie each minute of it is important and has something to say. The cinematography, music, sound design are all apt for the story and nothing extraordinary, which is a plus point as in this case it does not take away from the story that has a lot to say. Kani Kusruti plays the lead character Khadeeja, and she has done an amazing job. There are a few subtle expressions she does that convey the exact emotion of the character so well. Without Kani this whole movie might not even have been possible. The courage she took to play such a role that could get her a lot of backlash from the society we live in is to be appreciated. The climax is one whose morality could be questioned, but for the story I think it is a very apt one and only that climax can leave you with an impact that lasts. A fair warning though is that the movie is rated for adults only and even for adults, some scenes may be too raw and unwatchable, but those are necessary for the story and create the impact it does. Biriyaani is currently available on Cave OTT for streaming. </p>"
    },
    {
        "review_id": "10",
        "movie_name": "Kaithi",
        "rating": "4",
        "review_content": "<p>Being an action thriller from Tamil, I at first expected it to be a movie with a lot of enjoyable masala fights and not much of a great story, but as I progressed through the story I realized I was wrong, the depths given to Karthi&apos;s character is great and many other characters have key roles that guide the story forward in a smooth manner. There are usual masala movie scenes like where the hero is almost dead and wakes up and fights like nothing much happened, but keeping that aside, the direction by Lokesh Kanagaraj is something that has to be given props. A movie that could have been easily an below average experience is elevated to an above average experience by Lokesh&apos;s direction. The classy acting of Karthi as Dilli makes us sympathize with him and like him and root for him from the very beginning. There are situational humor scenes that help lighten the mood a bit. Cinematography is another aspect that stood out for me in this movie. There are few interesting shots that convey the scene very well. The Music did not give anything special. </p>"
    },
    {
        "review_id": "11",
        "movie_name": "Perks Of Being A Wallflower",
        "rating": "4.5",
        "review_content": "<p>The first thing that came to me as I finished this one is that why didn&apos;t I watch it untill now. This is a movie the touches you deeply. It has moments that make you both happy and sad at the same time. It has moments that make you nostalgic, moments that make you feel infinite. The music is so smooth and just eases you into the mood. The cinematography is something that is perfect for the movie. A few shots stand out and they just add the extra feel. All the main cast has done an incredible job of portraying all the quirks and goodness of the characters very well. This is a movie that you want to stay with. One that instantly became my favourite. </p>"
    },
    {
        "review_id": "12",
        "movie_name": "Malik",
        "rating": "4.5",
        "review_content": "<p>Another great one from Mahesh Narayan. The frames in this movie are so beautiful. The lengthy single shot in the beginning of the movie is well done and serves to enhance the feel of the scene and fit perfectly for it. The story, screenplay, direction, editing (basically everything Mahesh Narayan did) is very good. Fahad and Nimish as usual have done an great performance. Though I personally felt Nimisha&apos;s acting, especially in the old age more natural and it felt like a 60-70 year old woman itself. The plot of the movie is something that gave a start to many conversations and debates about the old case of Beemapally shooting, since Ramadapally and the settings in the movie closely resemble it. There are a few shortcomings when it comes to the dialogue delivery of the lead characters at times as it felt like they lost the Trivandrum slang, but it was minor and could go unnoticed easily. Vinay fort, the actor portraying his son have done a great job too. The music goes perfectly with the flow of the movie and adds to a certain beauty to it. The best thing that I felt is that it being a movie about an outlaw, there is no unnecessary glorification of the character. Another downside is that a few parts felt like they wouldn&apos;t be logical or happen in real life. Overall it&apos;s a must watch movie. </p>"
    },
    {
        "review_id": "13",
        "movie_name": "#HOME",
        "rating": "4.5",
        "review_content": "<p>This one by Rojin Thomas is a beautifully crafted feel good movie. It had been quiet sometime since such a movie came from Malayalam Cinema. The whole movie just keeps you glued to the screen and wanting to know more. You feel for the characters, be it their happiness, be it their sorrow, be it their regrets. The cinematography by Neil D&apos;Cuncha is something that ought to be praised. The frames and the visuals are so beautiful. It is both aesthetic and apt for the scene. The music by Rahul Subrahmanian also deserves credit as not in one place did the music felt standing out, or felt like it was a song, but rather it slowly nudges us into the mood and keeps us there in the mood of the scene. Acting by both Indrans and Manju Pilla are remarkable. Especially Indrans have proved yet again that he is capable of playing any character effortlessly to perfection. Naslen once again shows of a great performance in this one. Sreenath Bhasi has done his part well as well. The movie, even though a feel good one manages to integrate few key messages in a very natural feeling and apt manner and we do not feel like being preached to like many other movies that overly try to push a message. It might have a few imperfections here and there, but overall it is a great watch. I recommend it for anyone who loves feel good movies that can also slightly tug at your heartstrings. It is available on Amazon Prime. </p>"
    },
    {
        "review_id": "14",
        "movie_name": "Minnal Murali",
        "rating": "4.5",
        "review_content": "<p>The best Indian superhero movie, that is what this is. The origin story for Minnal Murali is phenomenal. The anti Hero played by Guru Somasundaram is just awesomely crafted and presented. Tovino does complete justice to Minnal Murali. The cinematography by Sameer Thahir, music by Shaan Rahman and Sushin Shyam and the VFX is all set perfectly. Basil Joseph has yet again delivered for the hype. Femina George has done a great job for her first movie. The only sad thing I felt is that I didn&apos;t get a chance to watch this one in the theatre cheering and celebrating with a lot more friends. Watch it on the biggest and the best screen with the best audio quality you can get. Take a Netflix subscription if you don&apos;t have one and just watch it. I can&apos;t wait to watch the sequel in theatres. </p>"
    },
    {
        "review_id": "15",
        "movie_name": "Bhoothakaalam",
        "rating": "4",
        "review_content": "<p>Rahul Sadasivan has done a great job of maintaining the tension for almost the entirety of the 1 hour 45 minutes movie rather than resorting to cheap scares. Gopi Sundar has done a good job on the BGM department to keep us in the mood. The outstanding aspect of the movie was the exceptional acting by Revathi and Shane. The nuances in the emotions and the expressions are just mind blowing. I usually don&apos;t watch horror movies, but I watched this one and really liked it. </p>"
    },
    {
        "review_id": "16",
        "movie_name": "Hridayam",
        "rating": "4.5",
        "review_content": "<p>This movie leaves you smiling. That is the only thing I could say to anyone after I saw this movie. Vineeth has yet again done an amazing job of perfectly telling a story, which is quiet frankly nothing new, in a way that pulls at your heartstrings and takes you through nostalgia trips while also making you reflect on life. All that beautiful story telling is perfectly matched by the Viswajith Odukkathil&apos;s cinematography and the transcending music by Hesham Abdul Wahab. Even with 15 songs, not one place do we feel that this song could have been avoided or that it was misplaced. Ranjan Abraham&apos;s editing plays a good role in the overall flow of the movie. Even though the movie is 171 minutes, not once while watching did I feel like it is long or when will it end. All 3 leads, Pranav, Darshana and Kalyani have done a great job when it comes to acting, Aswath Lal&apos;s Antony Thadikkaran and Annu Antony&apos;s Maya are other characters that stays with you. Hridayam is one movie that made me want to watch it again in Theatre itself and it is rare that I feel like that about any of the recent movies. </p>"
    },
    {
        "review_id": "17",
        "movie_name": "Beast",
        "rating": "2.5",
        "review_content": "<p>Beast is an out and out Vijay Entertainer. Story and screenplay are simple and weak at times. Action sequences are played out well by Vijay. Go in expecting a Vijay movie and not a Nelson movie and you will not be disappointed. Music by Anirudh goes in well and so does the choreography and Vijay&apos;s energy. There are a many comic elements, some of which don&apos;t workout as much as the others. There are many references to Vijay&apos;s old movies as well. Nothing out of the ordinary in terms of cinematography and coloring except a few robot camera shots. Overall one time enjoyable. If you do watch it watch it in theatre to get the best picture and sound experience. </p>"
    },
    {
        "review_id": "18",
        "movie_name": "Puzhu",
        "rating": "3.5",
        "review_content": "<p>Puzhu is a movie that makes you think and reflect on many aspects of our lives and society as a whole. The storyline encompasses a strong social commentary and is a must watch by everyone. That said, there were many scenes where I was able to predict the next action very easily which kind of took away from the thrill and surprise. Ratheena as a debutant has done a good job in delivering an enjoyable experience. Mammootty has yet again delivered a great performance with this character. Co-actors Parvathy and especially Appunni Sasi has done a good job as well. The background score does add to the ambiance. The cinematography was good but nothing stood out as great. Overall it is a good OTT movie that speaks about socially relevant topic. </p>"
    },
    {
        "review_id": "19",
        "movie_name": "Vikram",
        "rating": "4",
        "review_content": "<p>It is a perfect blend of action entertainment and storytelling. Throughout the movie you are engaged and eager to know what happens next. The 3 hour run time is not at all felt as long. All the main characters get ample screen time and give their best performance. Kamal Haasan, Vijay Sethupathi, Fahad Fasil, Naren and even Chemban Vinod stand out in their own way leaving you confused as to who your favourite character is. Surya&apos;s cameo at the end is just the icing that binds the whole cake together. The music and background score by Anirudh go in tune with mood of the film so does the cinematography by Girish Gangadharan. Lokesh and team have delivered a great one yet again. Overall a must watch in theatres. </p>"
    },
    {
        "review_id": "20",
        "movie_name": "Zakir Khan: Tathastu",
        "rating": "4.5",
        "review_content": "<p>I watch stand up very frequently and I&apos;ve seen many standup specials by both Indian and foreign comics. I have laughed a lot for some, related to some, agreed with some, surprised by some, but have never literally, broke out full on sobbing crying and the laughed my heart out a few minutes later. <br/>How does one do such a great show that even though it&apos;s a stand up comedy special, the people who watch it cry theirs eyes out and still leave laughing and happy. <br/>Totally not what I expected when I started to watch this show. Yet left me loving it so much. </p>"
    },
    {
        "review_id": "21",
        "movie_name": "RDX: Robert Dony Xavier",
        "rating": "3.5",
        "review_content": "<p>I went into this one expecting an action-packed movie and that is what I got. This is one action movie that made me go &quot;adikkada avane!&quot; while watching it. Haven&apos;t seen another movie that did that in a long while. All the lead characters, Robert (Shane Nigham), Doney (Antony Varghese Pepe) and Xavier (Neeraj Madhav) and their dad&apos;s played by Lal and Babu Antony all did an amazing job. The female lead of Mahima Nambiar as Mini also does a great job. The music by Sam C is on point and adds to the feel provided by the action sequences choreographed by Anbariv. The movie is edited just like how an action movie should be by Chaman Chakko. The screenplay and story just makes you root for the characters. Nahas Hidayath&apos;s has done a great job in bringing such an engaging, entertaining action film that also touches you emotionally. The way he connects the fights and the build-up to the climax sequence is just amazing. I would like to see Xavier&apos;s character be explored more and maybe even a possible spin-off would be great. Overall a theatre must watch if you love action movies. </p>"
    },
    {
        "review_id": "22",
        "movie_name": "Jawan",
        "rating": "3",
        "review_content": "<p>I went into the theatre with not much expectations as I had already seen the trolls about it being a mix of previous films. I still wanted to give the movie a chance as I believe in what SRK can do and also because Anirudh was doing the BGM. I personally felt that Atlee tried to fit too many things into one 2hr 45min movie. I was not bothered by most of the lack of logic in many plot points as they are soon glossed over and moreover, it is a mass action masala movie. One thing that Atlee has succeeded in and which I think is his strong point is giving the lead actors an old-age mass look. SRK&apos;s dad character in this one is well done, just like how he did with Vijay&apos;s Rayyappan in Bighil. The interval block was one of the high points in the film. Overall the movie has a combination of a lot of movies and reminded me of old Vijay and Kamal Hassan movies. In the end, though I left the theatre feeling happy and content, like I was able to switch off my brain and enjoy the world of fiction unfolding on screen for almost 3 hours. For anyone who does not have much experience with South Indian cinema (especially Tamil) and wants to watch a brains-off mass masala movie, this is worth watching. Overall for me, it was a one-time watch. </p>"
    },
    {
        "review_id": "23",
        "movie_name": "Malayankunju",
        "rating": "4.5",
        "review_content": "<p>On the surface, it is a survival thriller and it works best at it but it&apos;s not just that it has much deeper levels. It&apos;s not just the survival of a person trapped in a landslide, but it&apos;s also the survival of a person trapped within himself and his traumas and we get to see if he does escape or not. The writing by Mahesh Narayanan is gripping and him being the cinematographer as well just added to the visual beauty of the film. Sajimon Prabhakar has done a great job of effectively telling such a beautifully well-written script. A.R. Rahman&apos;s return to the Malayalam industry is great as well apart from a few places where the BGMs though good took away from the silence which could&apos;ve given more feel. Fahadh Fasil once again proves his skills as an actor by being the only character in almost the entirety of the 2nd half with just a couple of dialogues he was able to keep us hanging on the edge of our seats. Do watch it in a theatre with a good screen and audio. </p>"
    },
    {
        "review_id": "24",
        "movie_name": "Leo",
        "rating": "3.5",
        "review_content": "<p>I was surprised to see a Tamil movie tickets sold out on the first day in Canada as soon as the sales started. Such was the hype for this one. As a Vijay and Lokesh fan, I loved this movie. Lokesh has done something with Vijay and Vijay has given his 100% for this character. The character of Parthibhan is very well crafted and portrayed. Huge props to the crew and the technicians for pulling this off. Every actor gave a very good performance. The VFX was well done in some places and felt slightly underwhelming elsewhere. This movies gives us a different Vijay, one we haven&apos;t probably ever seen. Some characters could&apos;ve been explored more, and the villains were set up very big but fell short in their screen time. Especially Harold Das. Hopefully there will be exploration in possible future movies? The combination of Vijay and Thrisha as always is just lovely. The little girl Iyal and Mathews have also done a great job. Overall it&apos;s a must watch in theatre movie.</p>"
    },
    {
        "review_id": "25",
        "movie_name": "Neru",
        "rating": "4.5",
        "review_content": "<p>A courtroom drama well executed. Jeethu Joseph does it again. I went in expecting to see how well the director has used Mohnlal, I came out only having seen Vijaymohan fight for Sara&apos;s justice. Anashwara who plays Sara has done a phenomenal job as a blind girl. The nuances with which both the characters played by Anshwara and Mohnlal has been portrayed is perfect. Mohnlal just proved himself again doing what he does the best, being the character. Santhi Mayadevi and Jeethu Joesph has done an amazing job in writing this. Not a single second did I feel like looking away from the screen or even think about anything else. Siddique has done a great job as the opposing lawyer and makes you feel angry at the character. Jagadheesh yet again has done a great job as well. All the other supporting artists also has done a commendable job. The music has been used perfectly in making us feel the emotions. Nothing out of the ordinary in terms of cinematography and making. Overall, a must watch.</p>"
    },
    {
        "review_id": "26",
        "movie_name": "Malaikottai Vaaliban",
        "rating": "4.5",
        "review_content": "<p>One of the most unique movies I&apos;ve ever watched. It&apos;s a folklore told by our grandma brought to screen with the making style of a Wild West movie. The vastness and the intrigue of the world LJP has created is beautifully captured by Madhu Neelakandan&apos;s cinematography. Each frame feels like a painting. All the actors have done an amazing job. Definitely a theatrical experience. The background score is heavily inspired by the Wild West movies while the songs make you feel like it is from your nostalgia playlist. Malayalam&apos;s Mohanlal&apos;s Avataram, Malaikottai Vaalibhan deserves his story to be told. The battles he has seen, the battles that await. After all, “Kan kandathellaam poi, kan kaanathathu nijam, inni kaanapokirathu nijam” (what the eyes have seen is all bluff, what it hasn&apos;t seen is the truth, what it is going to see is the truth). Overall a must watch for anyone who loves to hear stories and experience beautiful visuals. </p>"
    },
    {
        "review_id": "27",
        "movie_name": "Bramayugam",
        "rating": "4.5",
        "review_content": "<p>Yet another unique movie from Rahul Sadasivan. The mix of kerala&apos;s culture, folklore and horror has been executed well. Just like his previous outing, he was able to maintain an ominous sense of anxiety while breaking tension at some points to make less overwhelming. The first half is a bit slow, but it makes you feel what the characters feel. Mammooty, Arjun Ashokan and Sidharth Bharathan all did an amazing job bringing the characters to life, but personally Arjun Ashokan stood a bit ahead for me. Shehnad Jalal has done a great job capturing the world of potti created by Jotish Shankar and team. The choice of using Black and White was great as it added to the ominous and periodic feel of the story. Christo Xavier&apos;s music is what keeps you hooked on to the screen. Sound design just lets you feel you are there with them. </p>"
    },
    {
        "review_id": "28",
        "movie_name": "Manjummel Boys",
        "rating": "4.5",
        "review_content": "<p>A gripping tale that shows the power of friendship. Anyone who has a gang of close friends and have gone on trips with them will find this movie taking them back to the good old days. You will end up missing your boys and feeling grateful for having them in your life. Chidambaram has done an amazing job of bringing this true story on to the screens. The way he gave space for and set up each of the boys was really nice. Kudos to Ajayan Chalissery and team for their work. Not at any single point did I feel that they weren&apos;t in the real cave. Sushin&apos;s music and the placement of Kanmani Anbodu song was just perfect. Shyju Khalid as usual has captured each and every frame beautifully. For me this was a movie about friendship, its resilience and strength than a survival thriller. </p>"
    },
    {
        "review_id": "29",
        "movie_name": "The Goat Life",
        "rating": "4.5",
        "review_content": "<p>This one had me in tears. To even think that a person might&apos;ve gone through something like this, even a small percentage of it brings immense grief. This movie is a must watch for anyone who loves the art of movies, a culmination of visual and auditory excellence. Blessy once again delivers a heart wrenching movie that takes you through the pain of the protagonist. Resul Pookutty has done an amazing job capturing the sounds and silence of the desert while A.R. Rahman scored it brilliantly. The music is just perfect for the situations. All the vastness, beauty and terror of the dessert has been beautifully captured by Sunil K.S. Prithviraj has done a phenomenal job, the subtle changes, the subtle gestures have all been portrayed very well. K.R Gokul has done a great job as well, so did Jimmy Jean-Louis and all other actors. I don&apos;t know if you&apos;ll be able to watch it a second time by a must watch in theatres. </p>"
    },
    {
        "review_id": "30",
        "movie_name": "Monkey Man",
        "rating": "4",
        "review_content": "<p>A tale of revenge told in a fast paced action thriller. I really liked the world they built, though I felt it was under explored. The fight choreography was really good and I liked how Sharone Meir took the camera along with the fighters. It was a refreshing and felt more real than choreographed. The movie did make me root for The Monkey Man and gave me few teary eyed moments. Dev Patel does a great job as the lead and the director. As a debutant director, the final result is really good. There were some details that I really liked, while there were some I thought they missed, but should&apos;ve taken into account. I loved the parallels between Hanuman&apos;s journey and the Monkey Man&apos;s. The social commentary on the caste and class system in India has come out well. All the supporting actors did a great job. Overall a good movie. </p>"
    },
    {
        "review_id": "31",
        "movie_name": "Aavesham",
        "rating": "4.5",
        "review_content": "<p>This is an all out entertainer. FaFaa just ruled the screen. Jithu Madhavan once again crafts a brilliant movie. The plot is thin, but the execution is excellent. The comedy, the fights and all have come out well. It indeed is a rollercoaster of a film. FaFaa as Ranga will be one of the most memorable characters. The way he&apos;s portrayed an eccentric character without it feeling too much or too little is really commendable. Hipster, Mithun and Roshan have done a great job. Sajin Gopu has done an amazing job as Ranga&apos;s top henchman. Sushin&apos;s music just elevated everything much more while Sameer Thahir captured everything without losing the energy. This is a must watch in theatres movie. </p>"
    },
    {
        "review_id": "32",
        "movie_name": "Varshangalkku Shesham",
        "rating": "4",
        "review_content": "<p>The journey of a filmmaker and his friend through the years. It takes you through some of the good and the bad phases of the Malayalam film industry. The highlight for me was Dhyan&apos;s performance and the songs. Just like any Vineeth Sreenivasan movie, it has a lot of songs and they carry the story. I liked how one song was used to evoke a variety of emotions throughout the movie. Nivin Pauly really scored in the second half. The movie got much more funnier and interesting in the second half. I felt that Pranav&apos;s character could&apos;ve been explored more. Really liked how Odukkathil Viswajith has captured the beauty and the details, especially the details created by Nimesh Thanur and team. While Amrith Ramnath&apos;s music blends it all in. Overall it&apos;s a feel good movie that will leave you feeling good. </p>"
    },
    {
        "review_id": "33",
        "movie_name": "Premalu",
        "rating": "4.5",
        "review_content": "<p>A well-made rom-com set in the city of Hyderabad. Girish A.D. again provides a fun-filled heartful movie. Naslen, Mamitha, Sangeeth, Akhila and especially Shyam have done a great job. The cinematography by Ajmal Sabu and the music by Vishnu Vijay fit well for the story. There are many laugh-out-loud moments and ones where it touches your heart. I felt good watching it. I am just sad that I wasn&apos;t able to catch it in the theatres. Overall it is a feel-good rom-com. </p>"
    },
    {
        "review_id": "34",
        "movie_name": "Liberal Arts",
        "rating": "3.5",
        "review_content": "<p>This is one of the few movies that have left me confused. I am not sure if I love it. But I don&apos;t hate it either. I loved certain parts of it like how the characters talk about art and its relation and connects to life, moreover I loved how the film connects the two and shows all aspects of it. I loved the performances and the making. I feel it&apos;s a very unique movie in the way it&apos;s structured and how it all plays out. It didn&apos;t connect to me as much as I hoped it would. It did take a unique approach and I appreciate it. Something about the film tells me that I&apos;ll like it better on repeat watch. </p>"
    },
    {
        "review_id": "35",
        "movie_name": "Boy Kills World",
        "rating": "4",
        "review_content": "<p>An action movie that shows the fight for freedom from a totalitarian regime. It is a powerful tale shown with brutal fight sequences. Moritz Mohr&apos;s choice to make the whole movie feel like we are watching a video game was unique and I loved it. The moments of organic comedy and emotional elements added to the flavour and ensured we connected with the characters and rooted for them. Bill Skarsgård and Yayan Ruhian were especially great with their performances while Quinn Copeland and the other cast supported them well. Overall, a must-watch if you love violent and brutal action movies. </p>"
    },
    {
        "review_id": "36",
        "movie_name": "Laapataa Ladies",
        "rating": "4.5",
        "review_content": "<p>This is probably the best movie to come out of Bollywood in recent times. On the surface, it is a fun, light-hearted tale of two brides getting mixed up, but the way it is presented and the subtle ways in which it shows the problems with certain rituals and practices are really beautiful. Kiran Rao tells this story with such finesse that you just fall in love with the movie. All the main characters have been portrayed well but Sparsh Srivastav&apos;s Deepak, Ravi Kishan&apos;s Inspector, Pratibha Ranta&apos;s and Nitanshi Goel as the brides were executed really well and they stay with you even after the movie. It is a must-watch movie. </p>"
    },
    {
        "review_id": "37",
        "movie_name": "The Fall Guy",
        "rating": "4.5",
        "review_content": "<p>Made as a tribute to all the stunt people in movies, and boy did it deliver. Showing what each one of them goes through to create the spectacle of an action movie and why they deserve to be praised and appreciated just like the actors. David Leitch being a stunt man himself has helped him craft something that plays out well on screen. The way he wove a beautiful love story and the simple fact that humans make mistakes and it&apos;s not about how bad you can take the hit but how many times you can take it. To each one of the unsung heroes that was involved with this, thank you for putting your life on the line for our entertainment. The storyline, especially towards the end reminded of the classic, Udhayananu Tharam, but set in Hollywood. Definitely a must watch for any movie lover and even anyone who&apos;d like to see a simple and different movie. </p>"
    },
    {
        "review_id": "38",
        "movie_name": "Guruvayoor Ambalanadayil",
        "rating": "4",
        "review_content": "<p>A fun comedy entertainer from Vipin Das. All the actors have done a good job, being exaggerated where needed for a movie like this. I really loved Basil and Prithviraj&apos;s chemistry. All the other supporting cast also felt fitting. The making is fun to watch and makes you chuckle throughout the movie. In terms of story, I felt that it didn&apos;t come up to my expectations in the climax. Really like the references to many other movies. Will be a good watch for family audience. Overall a one time watchable movie. </p>"
    },
    {
        "review_id": "39",
        "movie_name": "Furiosa: A Mad Max Saga",
        "rating": "4.5",
        "review_content": "<p>Another epic tale from the wasteland by George Miller. A fitting prequel to the Mad Max Fury Road. The origins of the mighty Furiosa has been portrayed with extreme detail. Anaya Taylor-Joy and Chris Hemsworth have done a phenomenal job. Alyla Browne as young furiosa has done remarkably as well. Simon Duggan has captured the vastness of the wasteland remarkably well. The world that George Miller has created is beautiful. Overall a must watch theatre experience. </p>"
    },
    {
        "review_id": "40",
        "movie_name": "Almost Pyaar with DJ Mohabbat Review",
        "rating": "4.5",
        "review_content": "<p>This movie tells those love stories that are messy.  The ones where there are flaws. The type of love that is imperfect, and incomplete. In the lines of Romeo & Juliet or Laila and Majnu. Anurag has done an amazing job handling the nuances of this story. He has given each of the leads room to perform. He handles the story with care and shows us what many of us might have heard or experienced before. To tell a love story that embraces the messiness and tries to navigate the maze of life is not easy but has been executed in this one with satisfaction. Amit Trivedi&apos;s music is soothing as always and carries the movie well, though I must say, I am not a fan of some of the lyrics. Sylvester Fonseca has captured the beauty, mess and realness of the story. Konark Saxena has done a good job with the edits, keeping the story flowing smoothly from one couple to the other. I must appreciate Alaya and Karan, both have played the characters with all their delicateness. Karan reminded me of Ranveer Singh in certain places. Vicky Kaushal as the narrator, DJ Mohabbat comes off almost like a philosopher, the one that talks for love. Overall, a must-watch movie for anyone who is a romantic with a broken heart. </p>"
    },
    {
        "review_id": "41",
        "movie_name": "Gaganachari",
        "rating": "4.5",
        "review_content": "<p>The mockumentary set in a dystopian Kerala is a very well crafted and executed experiment in Malayalam film industry. Ganesh stole the show, while Gokul, Aju and Anarkali support him well. The VFX and AI Generated imagery is almost perfect. Given the budget, this movie proves that it&apos;s not about the budget but about how well it is utilized. It is a humour filled fun watch that also mocks the current state of the country. The various references to nostalgic Malayalam movies was blended in well. The whole movie has a very good quality meme like feel, mocking everything related to sci-fi, dystopian movies/series, Kerala and current affairs. It sure is not everyone&apos;s cup of tea, but it is a must watch for anyone who likes to experience modern experiments with the art of cinema. </p>"
    },
    {
        "review_id": "42",
        "movie_name": "Kalki 2898-AD",
        "rating": "4.5",
        "review_content": "<p>A world class film with its roots firmly planted in Indian Mythology. Naga Ashwin has done a phenomenal job creating the intricate world filled with unique yet familiar characters. Major props to the VFX team the world that they have created is astonishing. Amitabh Bachan steals the show with such a strong character. While Prabhas and Deepika Padukone come equally close. Kamal Hassan has very little screen space but his presence is felt throughout the movie. All other characters and cameos, expected and unexpected were really well executed and placed. There has been references and influences from various world cinemas but all of it has been blend into our culture very well. There were moments in the first half where the scenes felt a little out of place, but the second half makes up for it and more. The world has been set and ready for the epic that is yet to unfold. Naga Ashwin is truly creating mythology with this one. Overall a must watch in best theatres. </p>"
    },
    {
        "review_id": "43",
        "movie_name": "Maharaja",
        "rating": "4.5",
        "review_content": "<p>A well written and executed crime thriller. Loved the non linear storytelling as it added to the suspense and made us keep guessing what will happen next. The underlying plot has been conveyed well. Vijay Sethupathi is back with his classic comman man turned hero due to the extraordinary circumstances and hits it out of the park. The light gags here and there was well placed and helped create more of an impact for the twists and turns. Nithilan Swaminathan has done a great job executing this plot effectively. He keeps you on the edge of the seat throughout the movie. Anurag Kashyap has done justice to the antagonist character, while all the supporting casts played their parts very well. Overall a must watch for anyone who loves crime thrillers. </p>"
    },
    {
        "review_id": "44",
        "movie_name": "The Greatest of All Time",
        "rating": "2",
        "review_content": "<p>Went into this movie expecting noting but a mediocre Vijay Template movie and walked out surprised. By surprised, I mean surprised that even without any big expectations, and being a Vijay fan, it failed to impress or even excite me anywhere. The story was full of massive holes and very predictable. The making was mediocre. All the songs were boring, even though it was supposed to be dance numbers. The de-aging is clumsy. The only things that remotely made it bearable was the BGM and the cameos. The post-credit scene was what completely destroyed whatever little decent impression I had. The villain felt like it was good in paper was terribly executed when it came to the screen, both acting and making wise. Overall only watch it if you are looking for a movie to roast. </p>"
    },
    {
        "review_id": "45",
        "movie_name": "A.R.M",
        "rating": "4",
        "review_content": "<p>A well made action adventure with some fantasy elements. Jithin Laal has done a good job with this one. The story is really engaging. Tovino has portrayed all three characters well with each of their unique characteristics. All the supporting cast has done a good job as well. Not sure if it was the issue of the theatre I went to or the makers, I felt the movie was overall darker than ideal and some scenes were lost in the dark. The fact that it was 3D and the glasses caused further darkening only added to the issue. Felt like the 3D elements were a nice addition but nothing out of the ordinary and mostly just a gimmick. The action choreography and the kalari scenes felt really authentic. Music by Dhibu Ninan Thomas lifted and supported the movie very well. The cinematography and frames were nice and I wish to experience it once more without the 3D elements so I can appreciate it better. Overall a good festival watch especially for families. </p>"
    },
    {
        "review_id": "46",
        "movie_name": "Kishkindha Kaandam",
        "rating": "4.5",
        "review_content": "<p>This one a perfectly made suspense thriller drama. Bahul Ramesh has crafted the story very thoroughly, each of the 3 main characters have lot of depth. Dinjith Ayyathan has done a phenomenal job creating and maintaining suspense with cleaver misdirections. Vijayaraghavan once again excels this role as an old father. Asif has put forward one of his best performances. Aparna as usual has done a great job. The story takes us with Aparna. She is a representation of our point of view. The movie progresses as she becomes more and more part of the family she&apos;s married into. Cinematography by Bahul Ramesh is very apt for the story and helps us feel like we are a silent observer in their world. Mujeeb Majeed with his music creates a sense of curiosity and suspense. He has done an amazing job in making us feel the emotions of the characters. Overall a must watch for anyone who loves drama and/or suspense thrillers. </p>"
    },
    {
        "review_id": "47",
        "movie_name": "Adios Amigos",
        "rating": "4.5",
        "review_content": "<p>A well crafted friendship movie. The whole theme revolves around two strangers becoming friends and the journey they go on. The only main characters are that of Suraj and Asif Ali and both of them have done a great job with it. Nowhere in the whole movie did I feel bored, though some scenes felt a bit repetitive but the conflicts keeps it going. There a few small characters that come and go that support, add and change the flow of the story here and there. The cinematography and music complements the making very well. Nahas Nazar has done good job with this debut. Overall a fun watch for anyone into friendship and travel movies. </p>"
    },
    {
        "review_id": "48",
        "movie_name": "Sector 36",
        "rating": "3.5",
        "review_content": "<p>A decent movie about a serial killer based on true events. The story was fairly interesting and to know that this happened here is kinda scary. The making was average and so was the cinematography and music. What I liked the most about the movie was the acting by Vikrant Massey as Prem Singh and Deepak Dobriyal as Ram Charan Pandey. Both of them has played the characters with a lot of nuance. Overall a one time watchable thriller movie. </p>"
    },
    {
        "review_id": "49",
        "movie_name": "Bharathanatyam",
        "rating": "4",
        "review_content": "<p>Krishnadas Murali has crafted a really fun, family entertainer. All the cast have done a great job. The story is very engaging. Each character has depth and nuance and is relatable making us get emotionally invested in it. There are lot of ironic moments that were really funny. Saiju Kurup, Saikumar and Abhiram Radhakrishnan have done an exceptional job with their characters. The costume design was spot on. The comedy and the setting is very realistic and funny and didn&apos;t feel forced at all. The music and cinematography was also apt for the story. Overall a must watch family entertainer. </p>"
    },
    {
        "review_id": "50",
        "movie_name": "Bougainvillea",
        "rating": "3",
        "review_content": "<p>A good suspense thriller. Was engaging throughout. Kunchako Boban, Srinda have done a good job, but Jothirmayi was truly amazing. Sharafudheen and Fahadh was really under utilised. The music by Sushin and cinematography Anend C. Chandran added the much needed mystery and suspense. The story as whole was underwhelming and felt like a mixture of many other movies we&apos;ve seen and loved. There were loop holes and missing pieces here and there in the story making the whole experience not what we expect from an Amal Neerad film. Overall one time watchable. </p>"
    },
    {
        "review_id": "51",
        "movie_name": "Hasan Minhaj: Off with His Head",
        "rating": "4.5",
        "review_content": "<p>One of the best comedians to come out of Beigie-stan delivering yet another banger. Hitting all the right notes and going hard and personal as usual. Love it.</p>"
    },
    {
        "review_id": "52",
        "movie_name": "Meiyazhagan",
        "rating": "4.5",
        "review_content": "<p>A beautiful tale of love and forgiveness. C. Prem Kumar delivers yet another movie that tugs at your heartstrings with the tenderness of the cool breeze on a summer evening. Govind Vasantha&apos;s music cradles you through the story while Mahendran Jayaraju captures the nostalgia in his frames. Karthi and Arvind Swamy have truly lived as the characters. Every other cast member supported them really well. I was teary eyed throughout the movie, either of sadness or of joy. Overall it&apos;s a must watch for anyone who loves feel good movies.</p>"
    },
    {
        "review_id": "53",
        "movie_name": "Pallotty 90&apos;s Kids",
        "rating": "4",
        "review_content": "<p>A small, fun tale of friendship among two young boys. Jithin Raj has done a good job as a debutant director. The movie takes us through a few months of their lives and how they figure out and enjoy life together. Filled with lot of heart touching and nostalgic moments. The two kids have done a really good job especially Davinchi Santhosh. The edits felt a bit jittery and out of place in the beginning. Manikandan Ayyappa has done a great job with the music and Sharon Sreenivas has captured the beauty of the villages of Thrissur. This movie will definitely trigger a lot of your childhood memories. Overall a must watch for anyone who loves feel good movies.</p>"
    },
    {
        "review_id": "54",
        "movie_name": "Amaran",
        "rating": "4.5",
        "review_content": "<p>A well made biopic of a real life hero. I loved how Rajkumar Periasamy has given equal importance to his personal and professional lives. Showing us the struggles a soldier and his family goes through for the nation. The way he handled the issues in Kashmir and the emotions of all the people involved was really nice and a refreshing and realistic take. Ch Sai captured the action and emotions very realistically. R. Kalaivanan has done a great job with the edits. G.V.P&apos;s music perfectly compliments the screenplay, tugging at our heartstrings during emotional moments and pumping up the adrenaline during action. Sivakarthikeyan has done justice to the hero in this portrayal. Sai Pallavi was so lovely, you feel each and every emotion she goes through. I felt was some of her Malayalam was not that great, but it&apos;s definitely better than what we normally hear in Tamil movies. All the supporting cast, especially the villains have done a good job. I liked how Anbariv and Vicky Arora have choreographed the action sequences. It didn&apos;t feel unnatural or over the top dramatic, it was more or less very realistic. Overall a must watch for anyone who likes military movies.</p>"
    },
    {
        "review_id": "55",
        "movie_name": "Sookshmadarshini",
        "rating": "4.5",
        "review_content": "<p>A well made thriller interspersed with situational comedy. A simple story with a unique twist told in a very interesting and thrilling manner. M C Jithin, Athul Ramachandran and Libin T.B. have done a great job in writing and M C has executed it brilliantly. The suspense was held throughout. Nazriya&apos;s has delivered an amazing comeback performance. Basil, Sidharth, the old lady have done a great job as well while the rest of the cast supported them well. Special mention to the cinematography team and the art team for setting up and capturing a seemingly mundane and normal surroundings without making it boring or distracting. Christo Xavier does a good job the score. This movie is yet another fitting reply to the people asking where the women of Mollywood are in commercial cinema space. Overall a must watch for anyone who likes thrillers.</p>"
    },
    {
        "review_id": "56",
        "movie_name": "Animal",
        "rating": "2",
        "review_content": "<p>The base idea was good but the way it was portrayed wasn&apos;t. Ranbir and Anil Kapoor&apos;s acting and the music was good. There were some good scenes. Overall wouldn&apos;t recommend.</p>"
    },
    {
        "review_id": "57",
        "movie_name": "Bloody Beggar",
        "rating": "4.5",
        "review_content": "<p>This one makes you feel laugh right from the opening. The theme does get progressively darker and I loved how each element and character connects to each other. M. Sivabalan has done an amazing job with writing and executing this one. Jen Martin&apos;s music adds to the comical elements very well while Sujith Sarang&apos;s cinematography captures it well, making us feel like we are in that world. R. Nirmal&apos;s edits make sure the at no point we take our eyes off the screen. Really liked the performances of Kavin, Redin Kingsley and the guy who acted as the method actor. All others did a good job as well. It does end leaving a few open ends, making me want a sequel. While on the surface the movie is a dark comedy entertainer, there&apos;s an underlying commentary on class hierarchy and greed. Overall a must watch for anyone who likes dark comedy and wants to just laugh for a few hours.</p>"
    },
    {
        "review_id": "58",
        "movie_name": "Hello Mummy",
        "rating": "4.5",
        "review_content": "<p>This is a comedy movie with horror/fantasy elements. The comedy leans heavily towards slapstick and it&apos;s been done really well. Haven&apos;t seen a good slapstick comedy movie like this where you get to laugh from beginning to end in a while. Yes if you expect to be scared like in other horror movies, you won&apos;t get it it here. This is a comedy movie with horror elements. I&apos;d categorise it in same category as The Scary Movie. Sharafudheen has done a great job with this one. His comic timing is great. Same goes for Johnny Antony. Aishwarya also does a good job with this one. Everyone else supports the cast well. The villain fell short and didn&apos;t quite give the impact he should have. The climax also wasn&apos;t as strong. Special props to the VFX and Special Effects team, they have a done a phenomenal job. Jakes Bejoy has done a good job with the music. As a debutant, Vaishak Elans has really done a great job. Overall a must watch for anyone who loves some fun, slapstick comedy.</p>"
    },
    {
        "review_id": "59",
        "movie_name": "Thanglaan",
        "rating": "4",
        "review_content": "<p>This is a powerful movie that shows the exploitation of the aboriginal people of Kolar and near by areas by rulers through centuries. With a mix of folklore and fantasy elements, Pa Ranjith creates a very interesting tale. One with that speaks for the people of the land, for the oppressed and against greed and the oppressors. A lot of discussions can be had on what the movie signifies and the many parallels that can be drawn. Even though the story and the performances were good, I didn&apos;t feel what the characters felt, which left me not getting the full effect of the movie. Really liked how the screenplay is done, creating intrigue. The visuals by A. Kishore Kumar is really beautiful and perfectly fits the movie. Expected more in the music department from GVP, though it might&apos;ve been a better theatre experience. Overall it&apos;s a good watch that reminds one to stand up for the oppressed.</p>"
    },
    {
        "review_id": "60",
        "movie_name": "Rifle Club",
        "rating": "4.5",
        "review_content": "<p>Guns, slow motion, laughs and whole lot of swag that&apos;s what this movie offers. Syam Pushkaran and Dileesh Nair provide a solid foundation in writing while Aashiq Abu builds a beautiful movie on top of it with his making. It would probably fit into the Tarantino sub genre. Just like many of his other films, each frame is beautifully crafted. Hanumankind, Anurag Kashyap and Dileesh Pothan were the show stealers while all the other actors have done a really good job, even the tiny roles have been done well that it leaves you feeling that they should have had more screen time. There are many strong and powerful women in this movie. Rex&apos;s music as always just takes the movie to whole new level. Overall, a must watch in theatres for anyone who likes a really fun and stylish action movie.</p>"
    },
    {
        "review_id": "61",
        "movie_name": "Vaazhai",
        "rating": "4.5",
        "review_content": "<p>Everyone should watch it.</p>"
    },
    {
        "review_id": "62",
        "movie_name": "Barroz: Guardian of Treasures",
        "rating": "2.5",
        "review_content": "<p>The directorial debut of the legendary actor Mohanlal, a Portuguese folklore set in Goa. A fantasy 3D movie made for kids is technically brilliant and new. The stereoscopic 3D gives a more realistic visual experience and 3D effects. The story is straightforward, almost too simple. The villains are not at all a match to the titular character. The movie fails to establish the stakes or connect emotionally with the characters. All the characters except Barroz, feel superficial and one-dimensional. Only Mohanlal&apos;s performance was decent everyone else was bad. The dubbing for the foreign characters was awful. Most of the VFX and the Voodo character animation was great, though not sure why it was given the accent it was. I liked how the movie tried to represent the diverse culture with actors from the same/similar descent than appropriate them. This movie is made for kids, but I don&apos;t think most kids these days will have the attention span to watch this due to the slow pacing of the movie. Overall a technically brilliant movie that became a letdown due to bad performances and making.</p>"
    },
    {
        "review_id": "63",
        "movie_name": "Identity",
        "rating": "3.5",
        "review_content": "<p>The second movie from Akhil Paul & Anas Khan duo is yet another action/investigative thriller. This one revolves around one murder. It starts out as a whodunit and transitions into whydunit. The cinematography by Akhil George and the action choreography by Yannick Ben and Phoenix Prabhu was really nice. Probably one of the best chase and the first plane fight in Malayalam. Jakes Bejoy&apos;s music compliments the film well. All the actors have performed well. Tovino and Trisha have really complex characters and it has been portrayed with its nuances really well. Really liked the way the movie treated the sensitive subject that is a major plot point in the movie. Also liked how they have made sure the movie holds up logically. I felt like Major Ravi&apos;s character was completely unnecessary. The storyline is complex and maybe that&apos;s why the directors chose to make it information heavy, though this might cause confusion to some audiences. Overall it&apos;s a good theatre watch for anyone who likes thrillers.</p>"
    },
    {
        "review_id": "64",
        "movie_name": "Rekhachithram",
        "rating": "4.5",
        "review_content": "<p>This one is in the genre of alternate history. I went in not knowing anything about the original incident. If I were told this was what happened, I&apos;d believe it. That&apos;s how well crafted this movie is. The alternate history has been weaved in really well. The cameos are minimal and executed well. Really liked Asif Ali and Anashwara. All the other cast have also done a really good job. The movie has many small tidbits that connect and take you to 1985, one such thing that I really liked is the font they used for lettering the credits. The movie has been beautifully captured by Appu Prabhakar while Shameer Muhammad&apos;s cuts keeps it tight and engaging throughout. Ramu Sunil and John Manthrickal have built a strong foundation with their writing which was executed with extreme nuance and care by Jofin T. Chacko. Mujeeb Majeed&apos;s music seamlessly flows from present day to 1985. Although I did notice a slight issue with the makeup for a couple of actresses, none of it affected the viewing experience. Overall a must watch for anyone who like investigative thrillers and alternate history movies.</p>"
    },
    {
        "review_id": "65",
        "movie_name": "Ennu Swantham Punyalan",
        "rating": "4",
        "review_content": "<p>A fun small movie surrounding a reluctant priest. It nice wraps mystery elements with a bit of fun and laughter. The performances by Anashwara and Arjun Ashokan were great while Balu Varghese did a good job as well. The other characters were good too. Sam CS once again has done a good job with the music Renadive captures the beauty. Samji M Antony has crafted a quirky, fun story while Mahesh Madhu brings it to screen in a satisfactory way. The movie filled me with hope and happiness. I left the theatre smiling. Overall a good watch for anyone who wants to just chill and watch a feel good fun movie.</p>"
    },
    {
        "review_id": "66",
        "movie_name": "Pravinkoodu Shappu",
        "rating": "4",
        "review_content": "<p>An experimental whodunit that has dark humour sprinkled on generously is a very tricky subject to crack as a debutant, which Sreeraj Sreenivasan has successfully achieved. The storytelling through multiple perspectives was really nice. Shafique Mohamed Ali has done a good job with editing creating a smooth and engaging experience. The cinematography by Shyju Khalid is as usual spectacular and the music by Vishnu Vijay is perfect for the mood of the movie. The performances by Soubin, Basil, Chemban & Chandni were really nice. Everyone else also gets a good amount of screen time and they have done a good job too. The resolution of the whodunit was very basic and felt rushed, that was a let down. Nevertheless it&apos;s a really good theatre watch. Overall a must watch for anyone who likes whodunits with some dark humour.</p>"
    },
    {
        "review_id": "67",
        "movie_name": "Bata Boy and Crocs Girl",
        "rating": "3",
        "review_content": "<p>Liked the style of filmmaking. Didn&apos;t like the story. Fun watch.</p>"
    },
    {
        "review_id": "68",
        "movie_name": "Dominic and the Ladies&apos; Purse",
        "rating": "3",
        "review_content": "<p>GVM&apos;s Malayalam directorial debut, produced by Mammooty Kampany is a fun investigative movie. As the name suggests, the movie revolves around the investigation for the owner of a ladies&apos; purse, which subsequently leads to more twists and turns. The first half was really engaging and fun. The second half, especially the climax was great very stale. I was dissatisfied with the way the resolution to the original case is shown. Neither did I like the climax twist. Loved the character of Dominic, Mammooty has played the quirky yet intelligent detective perfectly. The subtle humour and references did work really well. A really well written and strong character with a lot of potential. I got pink panther vibes. I really hope that there&apos;s a sequel with a better and more interesting case for Dominic. Gokul was nice but felt like he didn&apos;t have much to do. All other actors were mediocre at best. The choice of shooting with sync sound was a bad choice for this movie. The BGM by Darbuka Shiva was good but the two songs were a let down. I did like the cinematography and the edits. Overall it&apos;s a mediocre investigative movie with a really good character of Dominic.</p>"
    },
    {
        "review_id": "69",
        "movie_name": "Ponman",
        "rating": "4",
        "review_content": "<p>This is a movie that talks about a serious issue but in a way that it is neither too preachy nor superficial. Basil once again proves himself with the performance in this one, while Sajin Gopu, Lijomol, Anand also perform well. All the other supporting cast has been cast perfectly and does their part well. G. R. Indugopan brings a realness to the characters with this one, while Jyothish Shankar creates a compelling tale of persistence. Sanu John Varghese captures the rawness and the charm of Kollam. Justin Varghese adds in the subtle music that supports movie really well. Even though it&apos;s a tale of persistence by one man, on the inside, this is a really strong social commentary on some wrong practices that are very much prevalent even today and the way it affects all the parties involved. I must appreciate the team for taking up a topic like this and delivering it in a fun, engaging yet meaningful package. The movie is barely over 2 hours and I&apos;d have loved a few more scenes that&apos;s tied up and closed the one lingering gap that was there. Overall a must watch for anyone who is looking to watch an entertaining movie with a social message.</p>"
    },
    {
        "review_id": "70",
        "movie_name": "Vidaamuyarchi",
        "rating": "2",
        "review_content": "<p>A badly written movie that&apos;s been given a really good budget resulting in a technically advanced making. Unfortunately, the story has many holes and is very predictable especially in the first half. Moreover the movie drags so much that it indeed takes perseverance to sit through it without falling asleep. The only positives I felt was the shots, the stunts/action sequences. A lot of the dialogues are in Azerbaijani and since subtitles were only in Tamil I was left in the dark. Not sure if understanding that would&apos;ve improved the experience, since I felt that most of the important dialogues were also repeated in English or Tamil. Anirudh has made 2 tracks both are good but he has used one of it through the movie, making it feel stale and overused. I felt the de-aged/shaven look of Ajith very odd and distracting, I also didn&apos;t like his performance in emotional moments. Trisha & Arjun on the other hand have given a good performance while Regina also does a good job. Overall wouldn&apos;t recommend.</p>"
    },
    {
        "review_id": "71",
        "movie_name": "Narayaneente Moonnaanmakkal",
        "rating": "4",
        "review_content": "<p>This is a character study of the titular characters and their family. Sharan Venugopal&apos;s debut explores the complexities and the ephemeral nature of human relationships. Each of the characters that appear in the movie is written with depth making you feel that you are just watching a family go through a difficult time. He has intricately woven many layers into the characters and the story. None of the characters are good or bad, everyone is grey, just like anyone in the real world. Everyone is flawed, how they navigate the challenging situations that rise due to the unfortunate reunion of their broken family while their mother is in the deathbed forms the base of the story. Sharan manages to weave in social critique that is both subtle and evident. All the actors, except a few side characters have done a great job. Especially, Suraj, Joju, Alencier, Garggi Ananthan and Thomas Mathew have given amazing performances. Though Sajitha Madathil&apos;s performance felt a bit off at some points. Rahul Raj&apos;s music, the use of sync sound and Appu Prabhakar&apos;s cinematography perfectly backs the slow nature of the drama unfolding. The only downsides I felt was that the love subplot was very obvious from the beginning, unlike what they wanted it to be conveyed. Sharan doesn&apos;t intend to give any resolutions or preach about anything with this movie, he just wants to explore the characters and their relationships, which has been done very well. Overall, a really good watch for anyone interested in movies that explore human relationships and familial conflicts.</p>"
    },
    {
        "review_id": "72",
        "movie_name": "Interstellar",
        "rating": "4.5",
        "review_content": "<p>When the lines are blurred between screen and reality. Fortunate to get the IMAX experience like never before.</p>"
    },
    {
        "review_id": "73",
        "movie_name": "Bromance",
        "rating": "3",
        "review_content": "<p>The movie revolves around a guy with temper issues and a mixed group of people including the elder brother&apos;s friend, ex-girlfriend a goon and a hacker on a mission to find his missing elder brother. The movie is intended to be a loud, over the top, comedy and it sticks to this for most of the part. There are many laugh out loud moments created with the help of situations, Sanjeeth Prathap&apos;s character Hariharasudhan&apos;s witty remarks and clap backs. Mathew plays Binto the guy with temper issues and even though it plays well in towards the end, the way this is showcased is borderline annoying towards the middle. Mahima&apos;s character is fun but felt like she didn&apos;t have much to do for most of the part. Shyam who plays Shinto, Binto&apos;s elder brother has done a good job. Arjun Ashokan&apos;s Shabeer was also done well, especially in the final act. Shajon&apos;s Courier Babu does bring in a swagger and lot more humour. Sangeeth was the highlight of the whole movie. In terms of story, it&apos;s average the humour is what makes it better. Arun D Jose has tried to appeal with young so called “Gen Z” crowd and it felt like he was trying a bit too hard in many places, especially with that first song. Even though I enjoyed the visualisations I didn&apos;t like the lyrics. There is good use of chaos comedy and I really enjoyed that, but I wasn&apos;t able to connect with the core emotion of the movie, which decreased the impact for me. Overall it&apos;s an average fun comedy flick.</p>"
    },
    {
        "review_id": "74",
        "movie_name": "Painkili",
        "rating": "3",
        "review_content": "<p>This movie falls in the spoof genre. Sreejith Babu creates comedic sequences that are over the top and nonsensical. Jithu Madhavan tries to touch almost every topic that has gone viral on social media recently, pulling in a lot of references, some of which works while others don&apos;t. It employs a very loud and over the top comedy. The music by Justin Varghese perfectly captures the same over the top nature. Sajin Gopi once again proves what a versatile actor he is, his energy is truly amazing. While Anashwara has given a good performance and tries to match the energy, it does seem a little unintentionally cringy at certain points. Roshan and Chandhu have done a good job but isn&apos;t able to meet Sajin&apos;s energy levels. Jisma plays a character very close to the ones seen on her social media, and she does it well, she&apos;s probably the only one who&apos;s able to match Sajin&apos;s energy levels. Really liked Abu Salim and LJP&apos;s characters, both have done a good job. The cinematography is very colourful and refreshing. The emotional parts failed to create emotions and I think it would&apos;ve been better if they leaned more into the spoof nature. Overall it&apos;s a fun brains off watch.</p>"
    },
    {
        "review_id": "75",
        "movie_name": "Officer On Duty",
        "rating": "4",
        "review_content": "<p>An investigative thriller that follows the titular character played by Kunchacko Boban. Jithu Asharef wastes no time getting into the story by Shahi Kabir. Every incident plays into the plot really well. The editing by Chaman Chacko follows a non linear structure that&apos;s beautifully interconnected. Roby Varghese Raj takes us into the world of the movie with his cinematography while Jakes Bejoy holds us there and takes us through each emotion of the characters with his music. The fight sequences were choreographed really well and was refreshing. Really liked the minimal use of fights in a movie that could have gone overboard with a lot of fights. While all the actors have done a good job, the highlight for me was definitely Vishak who once again proves his worth by perfectly executing a character that could&apos;ve been easily overdone. Except for the use of a tiny, negligible plot convenience, it is a very tightly written script. The thrill comes from the hero achieving what we want him to rather than the investigation itself. Overall it&apos;s a great watch for anyone who likes investigative thrillers.</p>"
    },
    {
        "review_id": "76",
        "movie_name": "Dragon",
        "rating": "4",
        "review_content": "<p>The movie follows the titular character played by Pradeep Ranganathan as he grows from a studious high schooler into a rugged macho in his college and how that one decision changes his life. It is a fun filled coming of age comedy with a good message. Ashwanth Marimuthu&apos;s approach is really unique and effective. He used the familiar and proved treatment for a mass comedy entertainer while sprinkling it with unique visualisations and takes. The writing is solid and the making just ties everything together very well. Pradeep&apos;s performance was great, all the supporting cast also have done a good job. Leon James&apos; music perfectly compliments and further elevates the peak moments, be it emotional, mass or comedy. Overall it&apos;s a great fun filled mass comedy entertainer. Must watch in theatres.</p>"
    },
    {
        "review_id": "77",
        "movie_name": "Ouseppinte Osiyathu",
        "rating": "1.5",
        "review_content": "<p>This one tries to talk about greed and familial relationships but fails with terrible screenplay. Movies can be slow and still be engaging and entertaining but this one is neither of those while it is very slow. The casting of Vijayaraghavan, Dileesh Pothan, Shajohn, Lena, Zarin is good and they have performed well with what little the script offers. The rest of the cast was bad and their performances were also equally bad. There are so many plot holes in the story that I was wondering how none of it got noticed in any part of the filmmaking process. The cinematography was really good. There were continuity, costume and make up issues. Overall I wouldn&apos;t recommend it.</p>"
    },
    {
        "review_id": "78",
        "movie_name": "Pushpa 2 - The Rule",
        "rating": "2",
        "review_content": "<p>Why is this 3 hours and 45 minutes? If it was cut down to 2 hours it would&apos;ve been much better.</p>"
    },
    {
        "review_id": "79",
        "movie_name": "L2: Empuraan",
        "rating": "4.5",
        "review_content": "<p>The much awaited sequel to Lucifer. While lucifer mainly focused on the drama in Kerala politics, Empuraan takes things to the next level. Exploring the power and stature of Khureshi - Ab&apos;raam. The movie also spends significant amount of time giving us the background of Zayed Masood. Everything from weapons to helicopters to locations and characters have a realness. The frames by Sujith Vaassudev are truly spectacular. The making by Prithviraj takes it to new levels, unlike anything seen from Malayalam Film Industry. All the actors have done a great job, especially Abhimanyu Singh, Sukant Goel, Karthikeya, Manju Warrier, Tovino, Andrea, Jerome Flynn and of course Mohanlal. While the political drama is significantly lesser compared to Lucifer, whatever is there has a really good impact. Murali Gopy&apos;s writing once again does not spare anyone, it has a very strong political stance. Though I felt that the drama wasn&apos;t as deep as it was in Lucifer. Deepak Dev&apos;s music complimented the making well. The fights, especially the jungle fight has been done really well. The VFX was top notch, the cameos in the second half were really interesting. The mystery character reveal felt flat but is good start to the next part of the series. Really excited to see more about KA and how his decisions affect the Kerala Political landscape, with much higher stakes. Overall a must watch in theatres for anyone who is a lalettan fan and likes mass entertainers.</p>"
    },
    {
        "review_id": "80",
        "movie_name": "Baby Driver",
        "rating": "4",
        "review_content": "<p>Nice fun watch. Loved the use of music and minimal dialogues of the protagonist.</p>"
    }
]
