[
	{
		"thought_id":"1",
		"thought_heading":"Justice For All",
		"thought_info":"A few thought on the justice system.",
		"thought_content":"<p>When will this country be safe for females?</p><p>Inspite of changing governments one thing that had to be eradicated from India first hasn't still reduced rather it has increased.</p><p>I blame no leader or political party, instead I blame the constitution. People who commit such crimes deserve to be hanged in front of everyone like the rule in Saudi Arabia.</p><p>Now people might say Saudi is a monarchy and India is democratic, but let me tell you if such guys are left to live healthy lives in the expense of our taxpayers money, we are not punishing them but instead we are promoting them. I believe that if 1% of these guys are hanged in public, we can reduce the crime rate by 90-95%. I would like to ask a question to the Human Rights Activists (not all but who might defend the attacker), aren't the survivors humans? Don't they have rights or is it that because they are female you don't care. There has to be an end to this madness. Now a days people are driven by lust and selfishness rather than passion and honesty. The only way this can stop is if the law changes.</p><p>I would like to make a point clear though. I am not saying that whenever a female gives a complaint against a guy you execute him, no I am saying that once it's proved that he is guilty, execution should be the only punishment. Let's work together to become the *FOOL ( Future of the Law )*. Let's make a change. Let it not be about hashtags and request for justice for a few survivors who gets noticed by the media who is mostly busy covering marriages and gossips of famous people let it be *JUSTICE FOR ALL* (male or female (yes male rapes do happen though it is completely unnoticed by the majority.) ).</p>"
	},
	{
		"thought_id":"2",
		"thought_heading":"Explanation of Extraordinary.",
		"thought_info":"My thoughts on what is extra ordinary.",
		"thought_content":"<p>Explanation of Extraordinary.(15 July 2016)<br><p>Today as I lie down on my bed I am thinking what is extraordinary. At first I thought it was something out of the ordinary, but then I had a feeling that then everything in this world would be extraordinary. And that's not true, so I kept on thinking to know what is extraordinary!, amazing!, incredible!, and it struck to me just like a lightning on a sunny day, <b>SCIENCE + CREATIVITY = EXTRAORDINARY.</b> Why? Because science has been mostly the main part of everything we have today that is extraordinary. And about creativity, well its like the chocolate in the chocolate milkshake, creativity fuels the fire of science. It creates a sense of belief, it gives you power to dream and that's what we perceive as extraordinary.</p>"
	},
	{
		"thought_id":"3",
		"thought_heading":"My take on the Ghibli trend",
		"thought_info":"What I think about the current trend of AI generated Ghibli images.",
		"thought_content":"<p>I, like everyone else have been seeing a lot of images in the style of the famous Ghibli animation style. I do recognise that what ChatGPT is doing is plagiarism, and it should be called out for that because this is not the first time it is happening. Since the beginning of AI image generation, artists have raised concerns about their art being taken, used and plagiarised by many such AI without due credit. This is wrong and there should be proper rules and regulations as to how this is done and what the final products are used for.</p><p>Which brings me to the question, is it wrong for someone to want their photos converted into a style they like so they can put it on their social media for fun? I personally am of the opinion that if it is being used by individuals for their own satisfaction and fun, it is no harm. This is particular style might be a trend, but image generation is not something that is going to go away. The issue is when businesses, companies and other entities/people start profiting from this stolen art.</p><p>In my opinion, any AI that uses the art style of an artist should give the artist credit and also royalties for the same, since most AI do charge people to use the image generation feature. There should also be stricter rules and regulations that make sure the artist is protected and is compensated for their work and that it’s not just stolen by AI.</p><p>Just like how stock images became a solution to properly compensate the photographer, a similar system should be created for art/Ai generated art images as well. There can be an option where the companies pay artists to use their art to train the AI. Basically, buying the usage rights to their art work. Such an arrangement will provide many artists with proper compensation, while the companies and AI can still have access to and use good quality art without ripping of the artists that put years of work into crafting the style.</p><p>So next time you use AI to create images in an artists style take a second to understand and acknowledge that it is the years of work of an artist that has led to you being able to ask an AI to generate it in seconds. Give credit and support the real artist behind the art. Please don’t try to make a profit using the stolen art using AI.</p>"
	}
]
