[
	{
		"article_heading":"The Real Education We Need",
		"article_content":"<p>What is the current education like? Does it provide the receivers of it with the knowledge and tools to live a good life and does it help in making the society a better place for the coexistence of human beings along with the wide variety of flora and fauna? Well the answers to these questions are rather complicated but in short we can say no, or it is trying to. In my opinion our education system can improve by leaps and bounds if we make a few changes to it. When I talk about the education system and education here I am not only referring to the education from standardized institutions alone but also many other places from where we gain it.</p><p>In the modern world education can’t be considered as the mere gaining of knowledge, in fact this wasn’t the case in the ancient times either. In ancient times students used to stay with the teachers in the teachers’ houses which not only enabled the students to have a far better relationship with the teacher, one similar to that of a parent and child but it also provided the opportunity for a totally different kind of education, one where the student was predominantly taught to learn. The students learnt how to learn and along with it the various experiences gained during their stay at the teachers’ house, enabled them to understand themselves and work for becoming better. In modern education this notion of teaching to learn is absolutely absent, and this has resulted in the students stopping the learning process as soon as they step out of the institution. This is a huge failure of the education system because there exists so much knowledge in this vast universe that it is impossible to teach everything to a student in their lifetime. Instead the student should be taught to learn and understand from his/her experiences, this enables them to find what they want to learn and also for them to gain that knowledge from the various sources of knowledge out there, like books, teachers and the internet.</p><p>Another important concept or rather life lesson taught in ancient education was to accept failure. Accepting that you are not good at something is nothing bad instead it actually empowers you. It allows you to know what you can and can’t do efficiently which in turn gives you an immense advantage as you can then hire people who are good at things that you aren’t thereby enabling both to do the thing they wish with the help of the other. There is a proverb that goes something like, a person who knows his weakness well is much more powerful than the person who knows the enemy's strengths. This encapsulates the fact that not being good is not bad and that it is absolutely perfect. We are humans and nobody is perfect nor are we good at everything. Everybody has their own strengths and weaknesses and the knowledge of both will enable us to achieve a lot more. Modern education attributes significance to marks and winning rather than values. Albert Einstein wrote, “Everybody is a genius. But if you judge a fish by its ability to climb a tree, it will live its whole life believing that it is stupid.”. Yet this is how our education system works right now and it is high time there needs to be a change to this because not all people are created equal. This will help them coupe with and reduce the pressure the current education system puts on them. It will reduce student suicides and depression in students by a huge percentage because the root cause for these is majorly the pressure to score marks in some test or to become the first.</p><p>Money is one place our education system has failed yet again. Modern education does not teach us the real value of money and that it is nothing but just a tool. We can see a lot of rich people who have understood this in their life and this helps them live a better life. They learnt this through their life, through the experiences they have had. But this can also be taught by those who know this to those who don’t. This knowledge will help us not run behind money and instead make ways for it to come to us. This one change will reduce the increasing problem of stress and stress related issues.The idea of having money is weird and complex because for those who don’t have it, it is the solution to everything and for those who have it, it is nothing but a tool to help them do certain things. Having the knowledge that money is just a tool even when we don’t have it will help change our perspectives and the way we look at life and what we want to do with it. It is important to teach the children that there’s way more things much much more important than money in life and that in some situations it is better to lose money than to gain it.</p><p>Empathy is another thing that has to be included heavily in the education system. To teach the students to care for others like their own life is very important. Learning to respect life is very much important, whether it may be human or not. Education should teach the student that believes should not be above life, and that everyone has a right to live. It is not merely about eating vegan or not eating meat but it is about acknowledging that everything should have a limit. We see people killing each other in the name of religion, caste, gender, place of birth, and many other things, we see people do heinous stuff to others yet consider it heroic and this is because the education system has failed to teach them that life is much more valuable than anything else.</p><p>We also need to reflect on the notion of entitlement. Nobody is entitled to anything is the truth and students must be taught and encouraged to work hard and sacrifice some pleasures to gain what they want. They need to be taught to earn what they deserve instead of having it given to them. This will help them face the struggles of life and the ups and downs that are part of life. It will enable them to live a much more complete and successful life on their own terms.</p>"
	}
]